sterentev/atdf-device-asm-include/inc/ATmega32.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; [___2 addrs___] Stack Pointer 
.equ	OCR0		= 0x3C		; Output Compare Register
.equ	GICR		= 0x3B		; General Interrupt Control Register
.equ	GIFR		= 0x3A		; General Interrupt Flag Register
.equ	TIMSK		= 0x39		; Timer/Counter Interrupt Mask Register
.equ	TIFR		= 0x38		; Timer/Counter Interrupt Flag register
.equ	SPMCR		= 0x37		; Store Program Memory Control Register
.equ	TWCR		= 0x36		; TWI Control Register
.equ	MCUCR		= 0x35		; General Interrupt Control Register
.equ	MCUCSR		= 0x34		; MCU Control And Status Register
.equ	TCCR0		= 0x33		; Timer/Counter Control Register
.equ	TCNT0		= 0x32		; Timer/Counter Register
.equ	OCDR		= 0x31		; On-Chip Debug Related Register in I/O Memory
.equ	OSCCAL		= 0x31		; Oscillator Calibration Value
.equ	SFIOR		= 0x30		; Special Function IO Register
.equ	TCCR1A		= 0x2F		; Timer/Counter1 Control Register A
.equ	TCCR1B		= 0x2E		; Timer/Counter1 Control Register B
.equ	TCNT1		= 0x2C		; [___2 addrs___] Timer/Counter1  Bytes
.equ	OCR1A		= 0x2A		; [___2 addrs___] Timer/Counter1 Output Compare Register  Bytes
.equ	OCR1B		= 0x28		; [___2 addrs___] Timer/Counter1 Output Compare Register  Bytes
.equ	ICR1		= 0x26		; [___2 addrs___] Timer/Counter1 Input Capture Register  Bytes
.equ	TCCR2		= 0x25		; Timer/Counter2 Control Register
.equ	TCNT2		= 0x24		; Timer/Counter2
.equ	OCR2		= 0x23		; Timer/Counter2 Output Compare Register
.equ	ASSR		= 0x22		; Asynchronous Status Register
.equ	WDTCR		= 0x21		; Watchdog Timer Control Register
.equ	UCSRC		= 0x20		; USART Control and Status Register C
.equ	UBRRH		= 0x20		; USART Baud Rate Register High Byte
.equ	EEAR		= 0x1E		; [___2 addrs___] EEPROM Read/Write Access  Bytes
.equ	EEDR		= 0x1D		; EEPROM Data Register
.equ	EECR		= 0x1C		; EEPROM Control Register
.equ	PORTA		= 0x1B		; Port A Data Register
.equ	DDRA		= 0x1A		; Port A Data Direction Register
.equ	PINA		= 0x19		; Port A Input Pins
.equ	PORTB		= 0x18		; Port B Data Register
.equ	DDRB		= 0x17		; Port B Data Direction Register
.equ	PINB		= 0x16		; Port B Input Pins
.equ	PORTC		= 0x15		; Port C Data Register
.equ	DDRC		= 0x14		; Port C Data Direction Register
.equ	PINC		= 0x13		; Port C Input Pins
.equ	PORTD		= 0x12		; Port D Data Register
.equ	DDRD		= 0x11		; Port D Data Direction Register
.equ	PIND		= 0x10		; Port D Input Pins
.equ	SPDR		= 0x0F		; SPI Data Register
.equ	SPSR		= 0x0E		; SPI Status Register
.equ	SPCR		= 0x0D		; SPI Control Register
.equ	UDR		= 0x0C		; USART I/O Data Register
.equ	UCSRA		= 0x0B		; USART Control and Status Register A
.equ	UCSRB		= 0x0A		; USART Control and Status Register B
.equ	UBRRL		= 0x09		; USART Baud Rate Register Low Byte
.equ	ACSR		= 0x08		; Analog Comparator Control And Status Register
.equ	ADMUX		= 0x07		; The ADC multiplexer Selection Register
.equ	ADCSRA		= 0x06		; The ADC Control and Status register
.equ	ADC		= 0x04		; [___2 addrs___] ADC Data Register  Bytes
.equ	TWDR		= 0x03		; TWI Data register
.equ	TWAR		= 0x02		; TWI (Slave) Address register
.equ	TWSR		= 0x01		; TWI Status Register
.equ	TWBR		= 0x00		; TWI Bit Rate register
;
; ----------	REGISTERS PAIRS			------------------------
;    Stack Pointer 
.equ	SPH		= 0x3E
.equ	SPL		= 0x3D
;    Timer/Counter1  Bytes
.equ	TCNT1H		= 0x2D
.equ	TCNT1L		= 0x2C
;    Timer/Counter1 Output Compare Register  Bytes
.equ	OCR1AH		= 0x2B
.equ	OCR1AL		= 0x2A
;    Timer/Counter1 Output Compare Register  Bytes
.equ	OCR1BH		= 0x29
.equ	OCR1BL		= 0x28
;    Timer/Counter1 Input Capture Register  Bytes
.equ	ICR1H		= 0x27
.equ	ICR1L		= 0x26
;    EEPROM Read/Write Access  Bytes
.equ	EEARH		= 0x1F
.equ	EEARL		= 0x1E
;    ADC Data Register  Bytes
.equ	ADCH		= 0x05
.equ	ADCL		= 0x04


; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EECR bits		------------------------
.equ	EERIE		= 3		; 0x08 - EEPROM Ready Interrupt Enable
.equ	EEMWE		= 2		; 0x04 - EEPROM Master Write Enable
.equ	EEWE		= 1		; 0x02 - EEPROM Write Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCR bits		------------------------
.equ	WDTOE		= 4		; 0x10 - RW
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
.equ	WDP_MASK	= 0x07		;      - Watch Dog Timer Prescaler bits (3 bits)
.equ	WDP0		= 0		;          WDP BIT0 position
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 16K
;			0x01		; Oscillator Cycles 32K
;			0x02		; Oscillator Cycles 64K
;			0x03		; Oscillator Cycles 128K
;			0x04		; Oscillator Cycles 256K
;			0x05		; Oscillator Cycles 512K
;			0x06		; Oscillator Cycles 1024K
;			0x07		; Oscillator Cycles 2048K



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register GICR bits		------------------------
.equ	INT0		= 6		; 0x40 - External Interrupt Request 0 Enable
.equ	INT1		= 7		; 0x80 - External Interrupt Request 1 Enable
.equ	INT2		= 5		; 0x20 - External Interrupt Request 2 Enable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

