sterentev/atdf-device-asm-include/inc/ATmega32.inc
; ====	JTAG MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register OCDR bits		------------------------
.equ	OCDR_MASK	= 0xFF		;      - On-Chip Debug Register Bits (8 bits)
.equ	OCDR0		= 0		;          OCDR BIT0 position

; ----------	Register MCUCSR bits		------------------------
.equ	JTD		= 7		; 0x80 - JTAG Interface Disable
.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  WAVEFORM_GEN_MODE	:::: values
;			0b00		; Normal
;			0b10		; PWM, Phase Correct
;			0b01		; CTC
;			0b11		; Fast PWM
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 21
.equ	INT_VECTORS_SIZE	= 0x2A
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset  and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	INT2		; External Interrupt Request 2
;	4	TIMER2_COMP	; Timer/Counter2 Compare Match
;	5	TIMER2_OVF	; Timer/Counter2 Overflow
;	6	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	7	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	8	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	9	TIMER1_OVF	; Timer/Counter1 Overflow
;	10	TIMER0_COMP	; Timer/Counter0 Compare Match
;	11	TIMER0_OVF	; Timer/Counter0 Overflow
;	12	SPI_STC		; Serial Transfer Complete
;	13	USART_RXC	; USART, Rx Complete
;	14	USART_UDRE	; USART Data Register Empty
;	15	USART_TXC	; USART, Tx Complete
;	16	ADC		; ADC Conversion Complete
;	17	EE_RDY		; EEPROM Ready
;	18	ANA_COMP	; Analog Comparator
;	19	TWI		; 2-wire Serial Interface
;	20	SPM_RDY		; Store Program Memory Ready



; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "ATmega32.inc"
;#	
;#	; FUSES HIGH byte (addr 0x01)
;#	.set	BOOTSZ		= 0x02	; Boot Flash size=1024 words start address=$3C00
;#	.set	FUSES_HIGH	= 0xFF \
;#				  & ~(0 <<OCDEN) \
;#				  & ~(1 <<JTAGEN) \
;#				  & ~(1 <<SPIEN) \
;#				  & ~(0 <<CKOPT) \
;#				  & ~(0 <<EESAVE) \
;#				  &  (~BOOTSZ_MASK | BOOTSZ) \
;#				  & ~(0 <<BOOTRST)
;#	; FUSES LOW byte (addr 0x00)
;#	.set	SUT_CKSEL	= 0x21	; Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms; default value
;#	.set	FUSES_LOW	= 0xFF \
;#				  & ~(0 <<BODLEVEL) \
;#				  & ~(0 <<BODEN) \
;#				  &  (~SUT_CKSEL_MASK | SUT_CKSEL)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	BLB0		= 0x0C	; No lock on SPM and LPM in Application Section
;#	.set	BLB1		= 0x30	; No lock on SPM and LPM in Boot Section
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB) \
;#				  &  (~BLB0_MASK | BLB0) \
;#				  &  (~BLB1_MASK | BLB1)
;#	.message "===================="
;#	.message "-----  Fuses  ------"
;#	.message "HIGH            ", FUSES_HIGH
;#	.message "LOW             ", FUSES_LOW
;#	.message "----- Lockbits -----"
;#	.message "LOCKBIT         ", LOCKBITS_LOCKBIT
;#	.message "===================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET_ISR	; RESET		 - External Pin, Power-on Reset, Brown-out Reset  and Watchdog Reset
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; TIMER2_COMP	 - Timer/Counter2 Compare Match
;#		reti			; TIMER2_OVF	 - Timer/Counter2 Overflow
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_COMP	 - Timer/Counter0 Compare Match
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; SPI_STC	 - Serial Transfer Complete
;#		reti			; USART_RXC	 - USART, Rx Complete
;#		reti			; USART_UDRE	 - USART Data Register Empty
;#		reti			; USART_TXC	 - USART, Tx Complete
;#		reti			; ADC		 - ADC Conversion Complete
;#		rjmp	EE_RDY_ISR	; EE_RDY	 - EEPROM Ready
;#		reti			; ANA_COMP	 - Analog Comparator
;#		reti			; TWI		 - 2-wire Serial Interface
;#		reti			; SPM_RDY	 - Store Program Memory Ready
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET_ISR:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA32_INC_ */

; ************************ END OF FILE *********************************

